{"article": {"id": 1, "article": "<p>The first job that Eric had was not in a bank.</p>\n<p>This story began when he wanted a career where an oppurtunity to develop both personally and professionally. Eric started as a shopkeeper and then moved on to work at his dream job, a game development company.</p>\n<p>Afterwards, Eric graduated from Computer Science and Engineering from one of the leading universities in the United states. He then stepped into the financial world. However, he was not satisfied with his career growth at that time and chose to move onto the banking world through BCA to try out new challenges.</p>\n<p>It can be said that Eric really did start from scratch within the banking world. Before becoming the Head of BCA IT bureau, Eric started as an IT staff who handled card management for about seven years starting in 2005. He learned everything from scratch from understanding the flow of printing debit cards and credit cards to handling OpenSystem with Windows, Unix and Linux infrastructure.</p>\n<p>A new journey started when he was transferred to the Business and Cash unit in 2013 where he dealt with cards. His job changed from dealing with cards to supply chains, sending money to branches, and refilling ATM Machines.</p>\n<p>According to Eric, working as an IT employee at BCA is not difficult in technical terms. Instead, it is much more important to have negotiations skills. He added that the biggest challenge in working at BCA is finding that middle ground where almost all the users needs are taken into account. These negotiation skills are what led him to become the current Head of IT Bureau of BCA.</p>\n<p><img src=\"assets/content/articles/article-image/1/image1.jpg\" style=\"display: block; margin-left: auto; margin-right: auto;\"/></p>\n<p>Eric emphasized on how fair BCA is towards career paths. “BCA’s career path is clear as all you have to do is master the application and succeed in IT projects. Then your career path will be guaranteed by BCA.” BCA does not only support career paths but also the development of their employees such as facilitating the employees to attend various training classes and opportunities go abroad. These opportunities can range from studying, workshops or even international conferences.</p>\n<p>Eric felt lucky as he was able to learn most of the technical and non-technical skills that are essentiial for the job from his first boss. “My boss was very nice and taught me many things.” Until 2011, I continued to learn valuable lessons from my first boss at BCA.</p>\n<p>His boss was one of the main reasons that made him feel at home while he was at BCA. Other than receiving a good career path and fair compensation, Eric felt that not only he was able to grow professionally but also personally during his time in BCA.</p>\n<p>“I learned many social skills during my time at BCA such as managerial techniques, cooperation, negotiation, persuasive communication.”</p>\n<p><img src=\"assets/content/articles/article-image/1/image2.jpg\" style=\"display: block; margin-left: auto; margin-right: auto;\"/></p>\n<p>When Eric was asked for advice to reach a position of his level, Eric mentioned that perseverance and hard work are the two most important things for him to successfully become the Head of the IT bureau.</p>\n<p>Was it interesting to hear about the head of BCA IT’s joruney from start to finish? Even more when BCA can still help him develop personally and professionally in his current position.</p>\n<p>Interested in joining the BCA IT team? Learn about BCA career opportunities at <a href=\"https://karir.bca.co.id/it\">https://karir.bca.co.id/it</a>.</p>", "title": "Eric Anwar: Journey To Be a Leader", "tag": "news,article", "date": "2019-05-15", "thumbImage": "/assets/content/articles/article-image/1/thumbnail-image.jpg"}}