{"article": {"article": "<p class=\"bb-p\"><img src=\"assets/content/articles/article-image/7/image1.jpg\" style=\"display: block; margin-left: auto; margin-right: auto;\"/></p>\n<p class=\"bb-p\">For the games industry, Google Stadia is both an exciting opportunity and a looming crisis. It’s exciting because in the blink of an eye Google will remove almost all barriers to entry in gaming and allow anyone to play any game on any device. That’s huge. But it’s a looming crisis because this is Google. And Google runs YouTube. It’s an almighty <a class=\"bb-a\" href=\"https://www.urbandictionary.com/define.php?term=Crisitunity\">crisitunity</a>.</p>\n<p class=\"bb-p\">Right now, <a class=\"bb-a\" href=\"https://www.wired.co.uk/article/google-stadia-games-console-service-gdc-keynote\">Google Stadia</a> isn’t really anything other than a bold, technically impressive demo. And boy is it impressive. But caveats abound. In the stop-start history of games streaming – and let’s face it, it’s mostly been stop – we’ve been here before. But Stadia is tantalisingly different: it’s an ambitious bid to create a single platform for gaming and fundamentally change the entire industry. And Google definitely has the skills to pull it off.</p>\n<p class=\"bb-p\">But here’s the conundrum for the games industry – and gamers. Will Stadia do to games what YouTube has done to video? A frantic, algorithmically-powered race for attention that’s great for Google’s profits but, at times, bad for creatives. For a sneak preview, look at the free-to-play mobile gaming industry. Here, games that rely on how long people are willing to play – and thus how many adverts they see or in-game items they buy – are markedly different from console games. That’s not a specific issue with Google, but one the games industry as a whole (Nintendo aside, perhaps) will have to tackle as it moves from pay-per-game to games streaming.</p>\n<p class=\"bb-p\">That issue of changing the financial incentive for publishers is right at the core of what Google is proposing. Just like YouTube wasn’t about putting the TV on the internet, Stadia isn’t about shoehorning home console games onto a cloud streaming service. It’s about making gaming ubiquitous, never more than a click away from almost every corner of the internet. Which raises another question: who is Stadia for?</p>", "title": "If Google Stadia is the future, the games industry should be worried", "tag": "event,news", "id": 7, "thumbImage": "/assets/content/articles/article-image/7/thumbnail-image.jpg"}}