{"article": {"date": "2019-04-11", "article": "<p class=\"bb-p\"><img src=\"assets/content/articles/article-image/8/image1.jpg\" style=\"display: block; margin-left: auto; margin-right: auto;\"/></p>\n<p class=\"bb-p\">Pi just got bigger. Google’s Compute Engine has calculated the most digits of pi ever, setting a new world record.</p>\n<p class=\"bb-p\">Emma Haruka Iwao, who works in high performance computing and programming language communities at Google, used infrastructure powered by Google Cloud to calculate 31.4 trillion digits of pi. The previous world record was set by Peter Trueb in 2016, who calculated the digits of pi to 22.4 trillion digits. This is the first time that a publicly available cloud software has been used for a pi calculation of this magnitude.</p>\n<p class=\"bb-p\">Iwao became fascinated by pi when she learned about it in math class at school. At university, one of her professors, Daisuke Takahashi, was the record holder for the most-calculated digits of pi using a supercomputer. Now, y-cruncher is the software of choice for pi enthusiasts. Created in 2009, y-cruncher is designed to compute mathematical constants like pi to trillions of digits.</p>\n<p class=\"bb-p\">“You need a pretty big computer to break the world record,” says Iwao. “But you can’t just do this with a computer from a hardware store, so people have previously built custom machines.” In September of 2018, Iwao started to consider how the process of calculating even more digits of pi would work technically. Something which came up quickly was the amount of data that would be necessary to carry out the calculations, and store them – 170 terabytes of data, which wouldn’t be easily hosted by a piece of hardware. Rather than building a whole new machine Iwao used Google Cloud.</p>", "thumbImage": "/assets/content/articles/article-image/8/thumbnail-image.jpg", "id": 8, "title": "Google just smashed the world record for calculating digits of pi"}}